/* Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
456 -> 5
782 -> 8
918 -> 1*/

int numberRandom = new Random().Next(100, 1000); 

Console.WriteLine("Случайное трёхзначное число: " + numberRandom);
Console.Write("Вторая цифра случайного трёхзначного числа: ");
Console.WriteLine(numberRandom % 100 / 10);                                       //Самый простой способ вывода второй цифры случайного трёхзначного числа без функции.

int numberSecond = SecondDigitFunction(numberRandom);
Console.WriteLine("Вторая цифра случайного трёхзначного числа: " + numberSecond); //Вывод с помощью функции/метода второй цифры случайного трёхзначного числа без функции.

///////////////////////////////////////////////////////////////////////////////////////////////////////////
int SecondDigitFunction(int digit) // Функция/метод выделения второй цифры случайного трёхзначного числа //
{                                                                                                        //
  int result = digit % 100 / 10;                                                                         //
  return result;                                                                                         //
}                                                                                                        //
///////////////////////////////////////////////////////////////////////////////////////////////////////////