// Напишите программу, которая выводит случайное трёхзначное число и удаляет вторую цифру этого числа. Нужно написать хотя бы 1 функцию.
// Использовать массив.

int numberRandom = new Random().Next(100, 1000);                                           // Случайное число
int numberFirstAndThird = RandomFunction(numberRandom);                                    // Присвоение переменной трёхзначного числа без второй цифры

Console.WriteLine("Случайное трёхзначное число: " + numberRandom);
Console.WriteLine("Случайное трёхзначное число без второй цифры: " + numberFirstAndThird); // Вывод случайного трёхзначного числа без второй цифры

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
                                                                                                                                                                          //
int RandomFunction(int number)                                                              // Функция/метод, удаления из случайного трёхзначного числа второй цифры      //
{                                                                                                                                                                         //
    int[] array = new int[2]{number / 100, number % 10};                                    // Создаём массив                                                             //
    int result = Convert.ToInt32(array[0] + "" + array[1]);                                 // Склеиваем элементы массива                                                 //
                                                                                                                                                                          //
    return result;                                                                                                                                                        //
}                                                                                                                                                                         //
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

//Console.WriteLine(numberRandom/100 + /*"," + numberRandom%100/10 + ","*/ "" + numberRandom%10); //Самый простой способ вывода случайного трёхзначного числа без второй цифры